In [1]:
import pandas as pd

In [6]:
data = pd.DataFrame({'a': [1,2,3,4], 'b': [pd.np.nan]*4})

In [7]:
data

   a   b
0  1 NaN
1  2 NaN
2  3 NaN
3  4 NaN

In [10]:
data.dropna()

Empty DataFrame
Columns: [a, b]
Index: []

In [9]:
data.dropna(axis=1)

   a
0  1
1  2
2  3
3  4

In [11]:
data["日本語 スペースもあるよ"] = "hoge"

In [16]:
data

   a   b 日本語 スペースもあるよ
0  1 NaN         hoge
1  2 NaN         hoge
2  3 NaN         hoge
3  4 NaN         hoge

In [23]:
data.columns

Index(['a', 'b', '日本語 スペースもあるよ', 'bar'], dtype='object')

In [14]:
col_name = data.columns[2]

In [15]:
data[col_name]

0    hoge
1    hoge
2    hoge
3    hoge
Name: 日本語 スペースもあるよ, dtype: object

In [19]:
data["bar"] = data["日本語 スペースもあるよ"]

In [22]:
data

   a   b 日本語 スペースもあるよ   bar
0  1 NaN         hoge  hoge
1  2 NaN         hoge  hoge
2  3 NaN         hoge  hoge
3  4 NaN         hoge  hoge

In [21]:
data.bar

0    hoge
1    hoge
2    hoge
3    hoge
Name: bar, dtype: object

In [24]:
data["法人名"] = "ホゲ株式会社"

In [25]:
data

   a   b 日本語 スペースもあるよ   bar     法人名
0  1 NaN         hoge  hoge  ホゲ株式会社
1  2 NaN         hoge  hoge  ホゲ株式会社
2  3 NaN         hoge  hoge  ホゲ株式会社
3  4 NaN         hoge  hoge  ホゲ株式会社

In [26]:
company = "法人名"

In [27]:
data[company]

0    ホゲ株式会社
1    ホゲ株式会社
2    ホゲ株式会社
3    ホゲ株式会社
Name: 法人名, dtype: object

In [31]:
data[company] = data[company].apply(
    lambda x: x.replace("株式会社", "")
)

In [33]:
def remove_suffix(company_name):
    return company_name.replace("株式会社", "")

In [34]:
data[company] = data[company].apply(remove_suffix)

In [39]:
import random

In [42]:
random.Random(1)

In [84]:
random_string ="ab bc ce dg esss fss".split()

In [85]:
random_string

['ab', 'bc', 'ce', 'dg', 'esss', 'fss']

In [86]:
random.sample(random_string, k=1)

['ce']

In [87]:
sample_data = [random.sample(random_string, k=1)[0] for i in range(100)]

In [88]:
df = pd.DataFrame({"bar": sample_data})

In [89]:
train_x = pd.get_dummies(df, prefix_sep="", prefix="")

In [95]:
import re

In [106]:
re.match(r'.*(geho).*', "hogehogehogehogeho")

In [94]:
"hoge" in "hogehoge"

True

In [109]:
df.to_csv("random_string.csv", encoding="utf-8")